{"keras_version": "2.2.4", "class_name": "Sequential", "backend": "tensorflow", "config": {"name": "sequential_1", "layers": [{"class_name": "Reshape", "config": {"batch_input_shape": [null, 1002], "dtype": "float32", "name": "reshape_1", "target_shape": [501, 2], "trainable": true}}, {"class_name": "Conv1D", "config": {"batch_input_shape": [null, 501, 2], "kernel_constraint": null, "name": "conv1d_1", "dtype": "float32", "padding": "valid", "kernel_regularizer": null, "trainable": true, "use_bias": true, "dilation_rate": [1], "activation": "elu", "bias_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "strides": [1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "filters": 50, "kernel_size": [3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}}}, {"class_name": "Conv1D", "config": {"kernel_constraint": null, "name": "conv1d_2", "padding": "valid", "kernel_regularizer": null, "trainable": true, "use_bias": true, "bias_constraint": null, "activation": "elu", "bias_regularizer": null, "data_format": "channels_last", "dilation_rate": [1], "strides": [1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "filters": 50, "kernel_size": [10], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}}}, {"class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_1", "pool_size": [10], "data_format": "channels_last", "padding": "valid", "trainable": true, "strides": [10]}}, {"class_name": "Conv1D", "config": {"kernel_constraint": null, "name": "conv1d_3", "padding": "valid", "kernel_regularizer": null, "trainable": true, "use_bias": true, "bias_constraint": null, "activation": "elu", "bias_regularizer": null, "data_format": "channels_last", "dilation_rate": [1], "strides": [1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "filters": 80, "kernel_size": [10], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}}}, {"class_name": "GlobalAveragePooling1D", "config": {"name": "global_average_pooling1d_1", "data_format": "channels_last", "trainable": true}}, {"class_name": "Dense", "config": {"kernel_constraint": null, "name": "dense_1", "kernel_regularizer": null, "units": 64, "use_bias": true, "bias_constraint": null, "activation": "elu", "bias_regularizer": null, "activity_regularizer": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}}}, {"class_name": "Dense", "config": {"kernel_constraint": null, "name": "dense_2", "kernel_regularizer": null, "units": 32, "use_bias": true, "bias_constraint": null, "activation": "elu", "bias_regularizer": null, "activity_regularizer": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}}}, {"class_name": "Dense", "config": {"kernel_constraint": null, "name": "dense_3", "kernel_regularizer": null, "units": 16, "use_bias": true, "bias_constraint": null, "activation": "elu", "bias_regularizer": null, "activity_regularizer": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}}}, {"class_name": "Dense", "config": {"kernel_constraint": null, "name": "dense_4", "kernel_regularizer": null, "units": 8, "use_bias": true, "bias_constraint": null, "activation": "elu", "bias_regularizer": null, "activity_regularizer": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}}}, {"class_name": "Dense", "config": {"kernel_constraint": null, "name": "dense_5", "kernel_regularizer": null, "units": 2, "use_bias": true, "bias_constraint": null, "activation": "linear", "bias_regularizer": null, "activity_regularizer": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}}}]}}