{"keras_version": "2.2.4", "backend": "tensorflow", "class_name": "Sequential", "config": {"name": "sequential_1", "layers": [{"class_name": "Reshape", "config": {"trainable": true, "dtype": "float32", "batch_input_shape": [null, 1002], "name": "reshape_1", "target_shape": [501, 2]}}, {"class_name": "Conv1D", "config": {"trainable": true, "kernel_size": [3], "strides": [1], "bias_regularizer": null, "bias_constraint": null, "activity_regularizer": null, "kernel_constraint": null, "name": "conv1d_1", "activation": "elu", "kernel_regularizer": null, "data_format": "channels_last", "filters": 50, "use_bias": true, "dilation_rate": [1], "padding": "valid", "batch_input_shape": [null, 501, 2], "dtype": "float32", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}}}, {"class_name": "Conv1D", "config": {"trainable": true, "kernel_size": [10], "strides": [1], "bias_regularizer": null, "bias_constraint": null, "activity_regularizer": null, "kernel_constraint": null, "name": "conv1d_2", "activation": "elu", "kernel_regularizer": null, "data_format": "channels_last", "filters": 50, "use_bias": true, "dilation_rate": [1], "padding": "valid", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}}}, {"class_name": "MaxPooling1D", "config": {"trainable": true, "data_format": "channels_last", "strides": [10], "pool_size": [10], "padding": "valid", "name": "max_pooling1d_1"}}, {"class_name": "Conv1D", "config": {"trainable": true, "kernel_size": [10], "strides": [1], "bias_regularizer": null, "bias_constraint": null, "activity_regularizer": null, "kernel_constraint": null, "name": "conv1d_3", "activation": "elu", "kernel_regularizer": null, "data_format": "channels_last", "filters": 80, "use_bias": true, "dilation_rate": [1], "padding": "valid", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}}}, {"class_name": "GlobalAveragePooling1D", "config": {"trainable": true, "data_format": "channels_last", "name": "global_average_pooling1d_1"}}, {"class_name": "Dense", "config": {"trainable": true, "units": 64, "bias_regularizer": null, "bias_constraint": null, "activity_regularizer": null, "kernel_constraint": null, "name": "dense_1", "activation": "elu", "kernel_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}}}, {"class_name": "Dense", "config": {"trainable": true, "units": 32, "bias_regularizer": null, "bias_constraint": null, "activity_regularizer": null, "kernel_constraint": null, "name": "dense_2", "activation": "elu", "kernel_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}}}, {"class_name": "Dense", "config": {"trainable": true, "units": 16, "bias_regularizer": null, "bias_constraint": null, "activity_regularizer": null, "kernel_constraint": null, "name": "dense_3", "activation": "elu", "kernel_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}}}, {"class_name": "Dense", "config": {"trainable": true, "units": 8, "bias_regularizer": null, "bias_constraint": null, "activity_regularizer": null, "kernel_constraint": null, "name": "dense_4", "activation": "elu", "kernel_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}}}, {"class_name": "Dense", "config": {"trainable": true, "units": 2, "bias_regularizer": null, "bias_constraint": null, "activity_regularizer": null, "kernel_constraint": null, "name": "dense_5", "activation": "linear", "kernel_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}}}]}}