{"class_name": "Sequential", "keras_version": "2.2.4", "config": {"layers": [{"class_name": "Dense", "config": {"activity_regularizer": null, "units": 64, "activation": "elu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "use_bias": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "bias_regularizer": null, "dtype": "float32", "kernel_constraint": null, "trainable": true, "batch_input_shape": [null, 99], "name": "dense_1"}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "units": 32, "activation": "elu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "use_bias": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "bias_regularizer": null, "kernel_constraint": null, "trainable": true, "name": "dense_2"}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "units": 16, "activation": "elu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "use_bias": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "bias_regularizer": null, "kernel_constraint": null, "trainable": true, "name": "dense_3"}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "units": 8, "activation": "elu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "use_bias": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "bias_regularizer": null, "kernel_constraint": null, "trainable": true, "name": "dense_4"}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "units": 2, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "use_bias": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "bias_regularizer": null, "kernel_constraint": null, "trainable": true, "name": "dense_5"}}], "name": "sequential_1"}, "backend": "tensorflow"}