{"backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.2.4", "config": {"layers": [{"class_name": "Reshape", "config": {"batch_input_shape": [null, 402], "target_shape": [201, 2], "trainable": true, "name": "reshape_1", "dtype": "float32"}}, {"class_name": "Conv1D", "config": {"batch_input_shape": [null, 201, 2], "name": "conv1d_1", "data_format": "channels_last", "use_bias": true, "padding": "valid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "filters": 50, "bias_regularizer": null, "trainable": true, "bias_constraint": null, "strides": [1], "activation": "elu", "kernel_regularizer": null, "dtype": "float32", "kernel_size": [3], "activity_regularizer": null, "dilation_rate": [1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null}}, {"class_name": "Conv1D", "config": {"name": "conv1d_2", "data_format": "channels_last", "use_bias": true, "padding": "valid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "filters": 50, "bias_regularizer": null, "activation": "elu", "bias_constraint": null, "strides": [1], "trainable": true, "kernel_regularizer": null, "kernel_constraint": null, "kernel_size": [10], "activity_regularizer": null, "dilation_rate": [1], "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "MaxPooling1D", "config": {"strides": [10], "trainable": true, "name": "max_pooling1d_1", "data_format": "channels_last", "pool_size": [10], "padding": "valid"}}, {"class_name": "Conv1D", "config": {"name": "conv1d_3", "data_format": "channels_last", "use_bias": true, "padding": "valid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "filters": 80, "bias_regularizer": null, "activation": "elu", "bias_constraint": null, "strides": [1], "trainable": true, "kernel_regularizer": null, "kernel_constraint": null, "kernel_size": [10], "activity_regularizer": null, "dilation_rate": [1], "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "GlobalAveragePooling1D", "config": {"trainable": true, "name": "global_average_pooling1d_1", "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"name": "dense_1", "units": 64, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "bias_regularizer": null, "activation": "elu", "bias_constraint": null, "trainable": true, "kernel_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Dense", "config": {"name": "dense_2", "units": 32, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "bias_regularizer": null, "activation": "elu", "bias_constraint": null, "trainable": true, "kernel_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Dense", "config": {"name": "dense_3", "units": 16, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "bias_regularizer": null, "activation": "elu", "bias_constraint": null, "trainable": true, "kernel_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Dense", "config": {"name": "dense_4", "units": 8, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "bias_regularizer": null, "activation": "elu", "bias_constraint": null, "trainable": true, "kernel_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Dense", "config": {"name": "dense_5", "units": 2, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "bias_regularizer": null, "activation": "linear", "bias_constraint": null, "trainable": true, "kernel_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}], "name": "sequential_1"}}