{"config": {"name": "sequential_1", "layers": [{"config": {"kernel_regularizer": null, "batch_input_shape": [null, 99], "bias_regularizer": null, "activity_regularizer": null, "use_bias": true, "kernel_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "elu", "name": "dense_1", "units": 64, "dtype": "float32", "bias_constraint": null, "trainable": true}, "class_name": "Dense"}, {"config": {"kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "elu", "name": "dense_2", "units": 32, "bias_constraint": null, "trainable": true}, "class_name": "Dense"}, {"config": {"kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "elu", "name": "dense_3", "units": 16, "bias_constraint": null, "trainable": true}, "class_name": "Dense"}, {"config": {"kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "elu", "name": "dense_4", "units": 8, "bias_constraint": null, "trainable": true}, "class_name": "Dense"}, {"config": {"kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "linear", "name": "dense_5", "units": 2, "bias_constraint": null, "trainable": true}, "class_name": "Dense"}]}, "backend": "tensorflow", "keras_version": "2.2.4", "class_name": "Sequential"}