{"keras_version": "2.2.4", "backend": "tensorflow", "config": {"layers": [{"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "elu", "activity_regularizer": null, "trainable": true, "batch_input_shape": [null, 99], "name": "dense_11", "dtype": "float32", "bias_regularizer": null, "units": 64, "use_bias": true, "bias_constraint": null, "kernel_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}}, "class_name": "Dense"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "elu", "activity_regularizer": null, "trainable": true, "name": "dense_12", "bias_regularizer": null, "units": 32, "use_bias": true, "bias_constraint": null, "kernel_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}}, "class_name": "Dense"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "elu", "activity_regularizer": null, "trainable": true, "name": "dense_13", "bias_regularizer": null, "units": 16, "use_bias": true, "bias_constraint": null, "kernel_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}}, "class_name": "Dense"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "elu", "activity_regularizer": null, "trainable": true, "name": "dense_14", "bias_regularizer": null, "units": 8, "use_bias": true, "bias_constraint": null, "kernel_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}}, "class_name": "Dense"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "softmax", "activity_regularizer": null, "trainable": true, "name": "dense_15", "bias_regularizer": null, "units": 3, "use_bias": true, "bias_constraint": null, "kernel_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}}, "class_name": "Dense"}], "name": "sequential_3"}, "class_name": "Sequential"}