{"config": {"name": "sequential_1", "layers": [{"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "bias_regularizer": null, "dtype": "float32", "name": "dense_1", "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "batch_input_shape": [null, 99], "kernel_constraint": null, "units": 64, "kernel_regularizer": null, "use_bias": true, "activation": "elu", "bias_constraint": null}, "class_name": "Dense"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "bias_regularizer": null, "name": "dense_2", "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "kernel_constraint": null, "units": 32, "kernel_regularizer": null, "use_bias": true, "activation": "elu", "bias_constraint": null}, "class_name": "Dense"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "bias_regularizer": null, "name": "dense_3", "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "kernel_constraint": null, "units": 16, "kernel_regularizer": null, "use_bias": true, "activation": "elu", "bias_constraint": null}, "class_name": "Dense"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "bias_regularizer": null, "name": "dense_4", "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "kernel_constraint": null, "units": 8, "kernel_regularizer": null, "use_bias": true, "activation": "elu", "bias_constraint": null}, "class_name": "Dense"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "bias_regularizer": null, "name": "dense_5", "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "kernel_constraint": null, "units": 2, "kernel_regularizer": null, "use_bias": true, "activation": "softmax", "bias_constraint": null}, "class_name": "Dense"}]}, "class_name": "Sequential", "backend": "tensorflow", "keras_version": "2.2.4"}