{"class_name": "Sequential", "keras_version": "2.2.4", "config": {"layers": [{"class_name": "Reshape", "config": {"dtype": "float32", "trainable": true, "batch_input_shape": [null, 402], "name": "reshape_1", "target_shape": [201, 2]}}, {"class_name": "Conv1D", "config": {"padding": "valid", "batch_input_shape": [null, 201, 2], "kernel_constraint": null, "filters": 50, "bias_constraint": null, "data_format": "channels_last", "kernel_size": [3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "dtype": "float32", "trainable": true, "dilation_rate": [1], "bias_regularizer": null, "strides": [1], "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "activation": "elu", "name": "conv1d_1", "use_bias": true}}, {"class_name": "Conv1D", "config": {"padding": "valid", "kernel_constraint": null, "filters": 50, "bias_constraint": null, "kernel_size": [10], "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "dilation_rate": [1], "bias_regularizer": null, "strides": [1], "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "kernel_regularizer": null, "activation": "elu", "name": "conv1d_2", "use_bias": true}}, {"class_name": "MaxPooling1D", "config": {"padding": "valid", "trainable": true, "strides": [10], "pool_size": [10], "name": "max_pooling1d_1", "data_format": "channels_last"}}, {"class_name": "Conv1D", "config": {"padding": "valid", "kernel_constraint": null, "filters": 80, "bias_constraint": null, "kernel_size": [10], "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "dilation_rate": [1], "bias_regularizer": null, "strides": [1], "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "kernel_regularizer": null, "activation": "elu", "name": "conv1d_3", "use_bias": true}}, {"class_name": "GlobalAveragePooling1D", "config": {"trainable": true, "name": "global_average_pooling1d_1", "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"kernel_constraint": null, "bias_constraint": null, "units": 64, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "kernel_regularizer": null, "activation": "elu", "name": "dense_1", "bias_regularizer": null}}, {"class_name": "Dense", "config": {"kernel_constraint": null, "bias_constraint": null, "units": 32, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "kernel_regularizer": null, "activation": "elu", "name": "dense_2", "bias_regularizer": null}}, {"class_name": "Dense", "config": {"kernel_constraint": null, "bias_constraint": null, "units": 16, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "kernel_regularizer": null, "activation": "elu", "name": "dense_3", "bias_regularizer": null}}, {"class_name": "Dense", "config": {"kernel_constraint": null, "bias_constraint": null, "units": 8, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "kernel_regularizer": null, "activation": "elu", "name": "dense_4", "bias_regularizer": null}}, {"class_name": "Dense", "config": {"kernel_constraint": null, "bias_constraint": null, "units": 2, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "kernel_regularizer": null, "activation": "softmax", "name": "dense_5", "bias_regularizer": null}}], "name": "sequential_1"}, "backend": "tensorflow"}