{"keras_version": "2.2.4", "class_name": "Sequential", "backend": "tensorflow", "config": {"name": "sequential_1", "layers": [{"class_name": "Reshape", "config": {"dtype": "float32", "batch_input_shape": [null, 1002], "name": "reshape_1", "target_shape": [501, 2], "trainable": true}}, {"class_name": "Conv1D", "config": {"kernel_constraint": null, "activation": "elu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "bias_regularizer": null, "name": "conv1d_1", "padding": "valid", "use_bias": true, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3], "dtype": "float32", "activity_regularizer": null, "dilation_rate": [1], "kernel_regularizer": null, "batch_input_shape": [null, 501, 2], "filters": 50, "strides": [1], "trainable": true, "data_format": "channels_last"}}, {"class_name": "Conv1D", "config": {"kernel_constraint": null, "activation": "elu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "bias_regularizer": null, "name": "conv1d_2", "padding": "valid", "use_bias": true, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [10], "activity_regularizer": null, "dilation_rate": [1], "kernel_regularizer": null, "filters": 50, "strides": [1], "trainable": true, "data_format": "channels_last"}}, {"class_name": "MaxPooling1D", "config": {"data_format": "channels_last", "pool_size": [10], "name": "max_pooling1d_1", "strides": [10], "trainable": true, "padding": "valid"}}, {"class_name": "Conv1D", "config": {"kernel_constraint": null, "activation": "elu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "bias_regularizer": null, "name": "conv1d_3", "padding": "valid", "use_bias": true, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [10], "activity_regularizer": null, "dilation_rate": [1], "kernel_regularizer": null, "filters": 80, "strides": [1], "trainable": true, "data_format": "channels_last"}}, {"class_name": "GlobalAveragePooling1D", "config": {"name": "global_average_pooling1d_1", "trainable": true, "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"kernel_constraint": null, "activation": "elu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "bias_regularizer": null, "units": 64, "name": "dense_1", "use_bias": true, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_regularizer": null, "trainable": true}}, {"class_name": "Dense", "config": {"kernel_constraint": null, "activation": "elu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "bias_regularizer": null, "units": 32, "name": "dense_2", "use_bias": true, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_regularizer": null, "trainable": true}}, {"class_name": "Dense", "config": {"kernel_constraint": null, "activation": "elu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "bias_regularizer": null, "units": 16, "name": "dense_3", "use_bias": true, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_regularizer": null, "trainable": true}}, {"class_name": "Dense", "config": {"kernel_constraint": null, "activation": "elu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "bias_regularizer": null, "units": 8, "name": "dense_4", "use_bias": true, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_regularizer": null, "trainable": true}}, {"class_name": "Dense", "config": {"kernel_constraint": null, "activation": "softmax", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "bias_regularizer": null, "units": 3, "name": "dense_5", "use_bias": true, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_regularizer": null, "trainable": true}}]}}