{"backend": "tensorflow", "keras_version": "2.2.4", "class_name": "Sequential", "config": {"layers": [{"class_name": "Reshape", "config": {"trainable": true, "target_shape": [201, 2], "batch_input_shape": [null, 402], "name": "reshape_1", "dtype": "float32"}}, {"class_name": "Conv1D", "config": {"kernel_size": [3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "batch_input_shape": [null, 201, 2], "bias_regularizer": null, "name": "conv1d_1", "dilation_rate": [1], "activation": "elu", "dtype": "float32", "data_format": "channels_last", "padding": "valid", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "activity_regularizer": null, "filters": 50, "strides": [1], "trainable": true, "kernel_regularizer": null, "bias_constraint": null}}, {"class_name": "Conv1D", "config": {"kernel_size": [10], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "bias_regularizer": null, "name": "conv1d_2", "dilation_rate": [1], "activation": "elu", "data_format": "channels_last", "padding": "valid", "use_bias": true, "trainable": true, "kernel_constraint": null, "activity_regularizer": null, "filters": 50, "strides": [1], "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null}}, {"class_name": "MaxPooling1D", "config": {"pool_size": [10], "trainable": true, "name": "max_pooling1d_1", "strides": [10], "data_format": "channels_last", "padding": "valid"}}, {"class_name": "Conv1D", "config": {"kernel_size": [10], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "bias_regularizer": null, "name": "conv1d_3", "dilation_rate": [1], "activation": "elu", "data_format": "channels_last", "padding": "valid", "use_bias": true, "trainable": true, "kernel_constraint": null, "activity_regularizer": null, "filters": 80, "strides": [1], "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null}}, {"class_name": "GlobalAveragePooling1D", "config": {"trainable": true, "data_format": "channels_last", "name": "global_average_pooling1d_1"}}, {"class_name": "Dense", "config": {"units": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "bias_regularizer": null, "name": "dense_1", "activation": "elu", "use_bias": true, "trainable": true, "kernel_constraint": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_constraint": null}}, {"class_name": "Dense", "config": {"units": 32, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "bias_regularizer": null, "name": "dense_2", "activation": "elu", "use_bias": true, "trainable": true, "kernel_constraint": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_constraint": null}}, {"class_name": "Dense", "config": {"units": 16, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "bias_regularizer": null, "name": "dense_3", "activation": "elu", "use_bias": true, "trainable": true, "kernel_constraint": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_constraint": null}}, {"class_name": "Dense", "config": {"units": 8, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "bias_regularizer": null, "name": "dense_4", "activation": "elu", "use_bias": true, "trainable": true, "kernel_constraint": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_constraint": null}}, {"class_name": "Dense", "config": {"units": 3, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "bias_regularizer": null, "name": "dense_5", "activation": "linear", "use_bias": true, "trainable": true, "kernel_constraint": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_constraint": null}}], "name": "sequential_1"}}