{"backend": "tensorflow", "keras_version": "2.2.4", "config": {"layers": [{"config": {"kernel_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "use_bias": true, "dtype": "float32", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "units": 64, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "trainable": true, "batch_input_shape": [null, 99], "bias_regularizer": null, "activation": "elu", "name": "dense_1"}, "class_name": "Dense"}, {"config": {"activity_regularizer": null, "kernel_regularizer": null, "bias_constraint": null, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "elu", "kernel_constraint": null, "units": 32, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "trainable": true, "name": "dense_2"}, "class_name": "Dense"}, {"config": {"activity_regularizer": null, "kernel_regularizer": null, "bias_constraint": null, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "elu", "kernel_constraint": null, "units": 16, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "trainable": true, "name": "dense_3"}, "class_name": "Dense"}, {"config": {"activity_regularizer": null, "kernel_regularizer": null, "bias_constraint": null, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "elu", "kernel_constraint": null, "units": 8, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "trainable": true, "name": "dense_4"}, "class_name": "Dense"}, {"config": {"activity_regularizer": null, "kernel_regularizer": null, "bias_constraint": null, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "linear", "kernel_constraint": null, "units": 3, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "trainable": true, "name": "dense_5"}, "class_name": "Dense"}], "name": "sequential_1"}, "class_name": "Sequential"}