{"class_name": "Sequential", "keras_version": "2.2.4", "config": {"name": "sequential_1", "layers": [{"class_name": "Dense", "config": {"batch_input_shape": [null, 99], "bias_regularizer": null, "dtype": "float32", "name": "dense_1", "activation": "elu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "bias_constraint": null, "trainable": true, "kernel_regularizer": null, "use_bias": true, "units": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "kernel_constraint": null}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "use_bias": true, "name": "dense_2", "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "trainable": true, "activation": "elu", "kernel_regularizer": null, "units": 32, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "kernel_constraint": null}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "use_bias": true, "name": "dense_3", "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "trainable": true, "activation": "elu", "kernel_regularizer": null, "units": 16, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "kernel_constraint": null}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "use_bias": true, "name": "dense_4", "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "trainable": true, "activation": "elu", "kernel_regularizer": null, "units": 8, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "kernel_constraint": null}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "use_bias": true, "name": "dense_5", "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "trainable": true, "activation": "linear", "kernel_regularizer": null, "units": 3, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "kernel_constraint": null}}]}, "backend": "tensorflow"}