{"config": {"name": "sequential_1", "layers": [{"config": {"name": "reshape_1", "dtype": "float32", "target_shape": [501, 2], "batch_input_shape": [null, 1002], "trainable": true}, "class_name": "Reshape"}, {"config": {"strides": [1], "name": "conv1d_1", "batch_input_shape": [null, 501, 2], "dilation_rate": [1], "filters": 50, "activation": "elu", "bias_constraint": null, "kernel_size": [3], "kernel_constraint": null, "trainable": true, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "padding": "valid", "dtype": "float32", "data_format": "channels_last", "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "kernel_regularizer": null, "bias_regularizer": null}, "class_name": "Conv1D"}, {"config": {"strides": [1], "name": "conv1d_2", "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "dilation_rate": [1], "filters": 50, "activation": "elu", "bias_constraint": null, "kernel_size": [10], "kernel_constraint": null, "trainable": true, "padding": "valid", "bias_regularizer": null, "data_format": "channels_last", "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "kernel_regularizer": null}, "class_name": "Conv1D"}, {"config": {"strides": [10], "name": "max_pooling1d_1", "data_format": "channels_last", "pool_size": [10], "padding": "valid", "trainable": true}, "class_name": "MaxPooling1D"}, {"config": {"strides": [1], "name": "conv1d_3", "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "dilation_rate": [1], "filters": 80, "activation": "elu", "bias_constraint": null, "kernel_size": [10], "kernel_constraint": null, "trainable": true, "padding": "valid", "bias_regularizer": null, "data_format": "channels_last", "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "kernel_regularizer": null}, "class_name": "Conv1D"}, {"config": {"name": "global_average_pooling1d_1", "data_format": "channels_last", "trainable": true}, "class_name": "GlobalAveragePooling1D"}, {"config": {"name": "dense_1", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "elu", "bias_constraint": null, "kernel_constraint": null, "units": 64, "bias_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "use_bias": true, "activity_regularizer": null, "trainable": true}, "class_name": "Dense"}, {"config": {"name": "dense_2", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "elu", "bias_constraint": null, "kernel_constraint": null, "units": 32, "bias_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "use_bias": true, "activity_regularizer": null, "trainable": true}, "class_name": "Dense"}, {"config": {"name": "dense_3", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "elu", "bias_constraint": null, "kernel_constraint": null, "units": 16, "bias_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "use_bias": true, "activity_regularizer": null, "trainable": true}, "class_name": "Dense"}, {"config": {"name": "dense_4", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "elu", "bias_constraint": null, "kernel_constraint": null, "units": 8, "bias_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "use_bias": true, "activity_regularizer": null, "trainable": true}, "class_name": "Dense"}, {"config": {"name": "dense_5", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "linear", "bias_constraint": null, "kernel_constraint": null, "units": 3, "bias_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "use_bias": true, "activity_regularizer": null, "trainable": true}, "class_name": "Dense"}]}, "keras_version": "2.2.4", "class_name": "Sequential", "backend": "tensorflow"}