{"keras_version": "2.2.4", "backend": "tensorflow", "config": {"layers": [{"config": {"kernel_constraint": null, "batch_input_shape": [null, 99], "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "name": "dense_1", "trainable": true, "units": 64, "dtype": "float32", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "elu", "bias_regularizer": null, "activity_regularizer": null, "kernel_regularizer": null, "use_bias": true, "bias_constraint": null}, "class_name": "Dense"}, {"config": {"kernel_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "name": "dense_2", "trainable": true, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "elu", "bias_regularizer": null, "activity_regularizer": null, "kernel_regularizer": null, "units": 32, "bias_constraint": null}, "class_name": "Dense"}, {"config": {"kernel_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "name": "dense_3", "trainable": true, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "elu", "bias_regularizer": null, "activity_regularizer": null, "kernel_regularizer": null, "units": 16, "bias_constraint": null}, "class_name": "Dense"}, {"config": {"kernel_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "name": "dense_4", "trainable": true, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "elu", "bias_regularizer": null, "activity_regularizer": null, "kernel_regularizer": null, "units": 8, "bias_constraint": null}, "class_name": "Dense"}, {"config": {"kernel_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "name": "dense_5", "trainable": true, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "linear", "bias_regularizer": null, "activity_regularizer": null, "kernel_regularizer": null, "units": 4, "bias_constraint": null}, "class_name": "Dense"}], "name": "sequential_1"}, "class_name": "Sequential"}