{"backend": "tensorflow", "config": {"layers": [{"config": {"batch_input_shape": [null, 1002], "trainable": true, "dtype": "float32", "target_shape": [501, 2], "name": "reshape_1"}, "class_name": "Reshape"}, {"config": {"padding": "valid", "kernel_constraint": null, "data_format": "channels_last", "dtype": "float32", "bias_constraint": null, "activity_regularizer": null, "activation": "elu", "use_bias": true, "kernel_size": [3], "bias_regularizer": null, "filters": 50, "trainable": true, "batch_input_shape": [null, 501, 2], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "strides": [1], "dilation_rate": [1], "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "name": "conv1d_1"}, "class_name": "Conv1D"}, {"config": {"padding": "valid", "kernel_constraint": null, "data_format": "channels_last", "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "activity_regularizer": null, "activation": "elu", "use_bias": true, "kernel_size": [10], "filters": 50, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "strides": [1], "dilation_rate": [1], "bias_regularizer": null, "name": "conv1d_2"}, "class_name": "Conv1D"}, {"config": {"padding": "valid", "trainable": true, "data_format": "channels_last", "pool_size": [10], "strides": [10], "name": "max_pooling1d_1"}, "class_name": "MaxPooling1D"}, {"config": {"padding": "valid", "kernel_constraint": null, "data_format": "channels_last", "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "activity_regularizer": null, "activation": "elu", "use_bias": true, "kernel_size": [10], "filters": 80, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "strides": [1], "dilation_rate": [1], "bias_regularizer": null, "name": "conv1d_3"}, "class_name": "Conv1D"}, {"config": {"trainable": true, "data_format": "channels_last", "name": "global_average_pooling1d_1"}, "class_name": "GlobalAveragePooling1D"}, {"config": {"kernel_constraint": null, "units": 64, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "activity_regularizer": null, "activation": "elu", "use_bias": true, "kernel_regularizer": null, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "name": "dense_1"}, "class_name": "Dense"}, {"config": {"kernel_constraint": null, "units": 32, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "activity_regularizer": null, "activation": "elu", "use_bias": true, "kernel_regularizer": null, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "name": "dense_2"}, "class_name": "Dense"}, {"config": {"kernel_constraint": null, "units": 16, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "activity_regularizer": null, "activation": "elu", "use_bias": true, "kernel_regularizer": null, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "name": "dense_3"}, "class_name": "Dense"}, {"config": {"kernel_constraint": null, "units": 8, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "activity_regularizer": null, "activation": "elu", "use_bias": true, "kernel_regularizer": null, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "name": "dense_4"}, "class_name": "Dense"}, {"config": {"kernel_constraint": null, "units": 4, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "activity_regularizer": null, "activation": "linear", "use_bias": true, "kernel_regularizer": null, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "name": "dense_5"}, "class_name": "Dense"}], "name": "sequential_1"}, "class_name": "Sequential", "keras_version": "2.2.4"}